================================================================================
Simple number expression
================================================================================

42;

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (number)))

================================================================================
Variable declaration
================================================================================

let x = 5;

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    name: (identifier)
    value: (number)))

================================================================================
Binary addition
================================================================================

2 + 3;

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      left: (number)
      operator: "+"
      right: (number))))

================================================================================
Precedence test - multiplication binds tighter than addition
================================================================================

2 + 3 * 4;

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      left: (number)
      operator: "+"
      right: (binary_expression
        left: (number)
        operator: "*"
        right: (number)))))

================================================================================
Parenthesized expression overrides precedence
================================================================================

(2 + 3) * 4;

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      left: (parenthesized_expression
        (binary_expression
          left: (number)
          operator: "+"
          right: (number)))
      operator: "*"
      right: (number))))

================================================================================
Variable reference in expression
================================================================================

x + 5;

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (binary_expression
      left: (identifier)
      operator: "+"
      right: (number))))

================================================================================
Floating point numbers
================================================================================

3.14159;

--------------------------------------------------------------------------------

(source_file
  (expression_statement
    (number)))

================================================================================
Comments are ignored
================================================================================

// This is a comment
let x = 5; // End of line comment

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    name: (identifier)
    value: (number)))